{
  "title": "The Last of Us 2",
  "status": "completed",
  "year": 2020,
  "image": "/src/assets/images/games/tlou2.jpg",
  "rating": 5,
  "review": "The Last of Us Part II is undoubtedly a technically outstanding project, yet it evokes mixed feelings, particularly regarding the balance between gameplay mechanics and narrative structure.\n    From a gameplay perspective, the game left me with an overwhelmingly positive impression. The developers succeeded in creating a deep and varied system of interaction with the environment and enemies. I particularly want to highlight the detailed tactical possibilities: the ability to use low cover, crawl under obstacles like trucks, or flexibly plan actions for stealth sequences or direct confrontations – all this demonstrates a high level of game design thought and provides the player with a wide scope for tactical experimentation.\n    The game's visual component is executed at a superb level. Playing on the Steam Deck, I was pleasantly surprised by the quality of optimization for this device. Despite the project's scale and graphical detail, the game exhibits stable performance with a minimal number of freezes, which is rare for portable hardware and speaks to quality technical work. Visually, the game looks good even on the Steam Deck.\n    However, the aspects concerning character development and the plotline felt, frankly, unnecessarily bloated and raised certain questions for me. The game touches upon the rather well-worn theme of the senselessness of revenge, which could potentially have been explored much more convincingly. As a result, the execution of this theme feels somewhat muddled. Character motivations and shifts in stance are often presented without sufficient justification or appear rushed, which hinders empathy and understanding of their actions. Furthermore, attempts to provide the player with moral \"choices\" ultimately have no significant impact on the plot's progression, undermining the sense of agency and making these moments feel formal.\n    There is also a general sense of the narrative and gameplay sections being overly drawn out, particularly in the middle part of the game. The peak of this feeling occurred approximately upon reaching the island of the Seraphites.\n    In conclusion, The Last of Us Part II undoubtedly deserves attention due to its outstanding gameplay foundation and magnificent technical execution. However, despite its ambition, the game's narrative part and character development raise questions and, in my opinion, do not reach the same level of perfection as the gameplay mechanics. The game should primarily be recommended to those who value deep and varied gameplay, rather than solely for the sake of the story.",
  "recommendationEmoji": "😐",
  "order": 1
}
